[
  {
    "num": 102,
    "season": 2025,
    "datetime": "2025-11-18T19:00:00+02:00",
    "place": {
      "addr": "Veerenni 24, 10135 Tallinn", "loc": "https://maps.app.goo.gl/8G7Q95boekzc7u286",
      "name": "Wise", "url": "https://wise.com/"
    },
    "org": {"mod": [], "photo": []},
    "photo": [],
    "event": "",
    "speeches": [
      {
        "org": {"cam": [], "edit": []},
        "youtube": [], "lang": "en",
        "labels": ["programming", "database", "finances"],
        "speakers": [
          {
            "image": "dhnatiuk.jpg",
            "names": {"*": "Dmytro Hnatiuk"},
            "titles": {"*": "Principal Software Engineer @ Wise"},
            "url": "https://www.linkedin.com/in/dhnatiuk/"
          }
        ],
        "titles": {
          "*": "Scaling a Beast: Lessons from 400x Growth in a High-Stakes Financial System"
        },
        "descr": {
          "en": [
            "Scaling a system from 66 million to over 25 billion records is no easy feat - especially when it’s a core financial system where every number has to be right, and data needs to be fresh right now. In this session, I’ll share the ups and downs of managing this kind of growth without losing my sanity. You’ll learn how to balance high data accuracy with real-time performance, optimize your app logic, and avoid the usual traps of database scaling. This isn’t about turning you into a database expert - it’s about giving you the practical, no-BS strategies you need to scale your systems without getting overwhelmed by technical headaches. Perfect for engineers and architects who want to tackle big challenges and come out on top."
          ]
        }
      },
      {
        "org": {"cam": [], "edit": []},
        "lang": "en",
        "labels": [],
        "youtube": [],
        "speakers": [
          {
            "image": "anna_shishkova.jpeg",
            "names": {"*": "Anna Shishkova"},
            "titles": {"*": "Product Business Analyst"},
            "url": "https://www.linkedin.com/in/anna-shishkova-3b435264/"
          }
        ],
        "titles": {"*": "Service Design in Action: From Concepts to Real-World Impact"},
        "descr": {
          "*": [
            "This presentation explores the essence of Service Design — what it is, who it’s for, and how it helps organizations create meaningful value. Through practical examples, we’ll look at how service design principles drive innovation and improve customer experiences across industries."
          ]
        }
      }
    ]
  }
]
