[
  {
    "num": 183,
    "datetime": "2024-11-27T19:00:00+02:00",
    "season": 2024,
    "place": {
      "name": "Askend", "loc": "https://maps.app.goo.gl/5zSHSSQestoERXcJ9",
      "addr": "Tartu mnt 80f, 2nd floor, Tallinn 10137", "url": "https://maps.app.goo.gl/NepvKvm79FwovdxJ6"
    },
    "org": {"mod": [""], "photo": [""]},
    "photo": [""],
    "event": "https://www.eventbrite.com/e/",
    "speeches": [
      {
        "org": {"cam": [""], "edit": [""]},
        "lang": "ru",
        "labels": [],
        "youtube": [],
        "speakers": [
          {
            "names": {"*": "Vladimir Ovodenko", "ru": "Владимир Оводенко"},
            "titles": {"*": "Test Automation Lead @ Inbank"},
            "url": "https://www.linkedin.com/in/ovodenko/",
            "image": "vovodenko.jpg"
          }
        ],
        "titles": {"ru": "Пирамида тестирования с Playwright"},
        "descr": {
          "ru": [
            "В этом докладе я расскажу о нашем пути в Inbank по улучшению опыта разработчиков и повышения их продуктивности с помощью автоматизации тестирования. Мы подробно остановимся на процессах, которые позволили нам разработать надежную стратегию автоматизации тестирования, с акцентом на сквозное (E2E) и компонентное тестирование, оба реализованных с использованием фреймворка Playwright. На практических примерах я покажу, как реализовать оба типа тестов. Также я поделюсь стратегиями, которые помогают поддерживать тестовый набор надежным и свести к минимуму нестабильность тестов."
          ]
        }
      },
      {
        "org": {"cam": [""], "edit": [""]},
        "lang": "ru",
        "labels": [],
        "youtube": [],
        "speakers": [
          {
            "names": {"*": "Grigori Parfjonov", "ru": "Григорий Парфёнов"},
            "titles": {"*": "Lead Software Engineer @ Guardtime"},
            "url": "https://www.linkedin.com/in/pavelgrigorenko/",
            "image": "gparfjonov.png"
          }
        ],
        "titles": {"ru": "Идеальный город для людей: иллюзии комфорта и реальность компромиссов"},
        "descr": {
          "ru": [
            "Все хотят «город для людей» — звучит мило, пока не приходится превращать мечты в реальность. Как будто скамейка и газончик посреди 3+3 полос магически превратят магистраль в райское место для прогулок — но попробуй ещё объясни, куда девать транспортные потоки. В этом докладе я расскажу, как микромоделирование транспортных потребностей превращается в головоломку, когда инженер пытается угодить всем, лавируя между амбициями одних и реальностью движения других. PHP для транспортного инженера: как балансировать на грани комфорта и здравого смысла ради идеала, который то и дело разъезжается с логикой."
          ]
        }
      }
    ]
  }
]
