[
  {
    "num": 175,
    "datetime": "2024-02-22T19:00:00+02:00",
    "season": 2024,
    "place": {
      "name": "Wisercat Estonia OÜ", "loc": "https://goo.gl/maps/bKgbrTmjPkP2",
      "addr": "Tartu mnt 80f, 2nd floor, Tallinn 10137", "url": "https://maps.app.goo.gl/NepvKvm79FwovdxJ6"
    },
    "org": {"mod": ["izverev"], "photo": ["gbeskin"]},
    "photo": [""],
    "event": "https://www.eventbrite.com/e/devclubeu-175-tickets-830125075447",
    "speeches": [
      {
        "org": {"cam": ["eweber"], "edit": ["klinnik"]},
        "lang": "ru",
        "labels": [],
        "youtube": [],
        "speakers": [
          {
            "names": {"*": "Aleksei Jašin", "ru": "Алексей Яшин"},
            "titles": {"*": "Советник министра экономики и ИТ"},
            "url": "https://www.linkedin.com/in/aleksei-jašin-27b503140/",
            "image": "ajashin.jpg"
          }
        ],
        "titles": {"ru": "Почему государство хочет быть в ваших смартфонах? История приложения mRiik."},
        "descr": {
          "ru": [
            "Все меньше жителей Эстонии использует повседневно настольные компьютеры и лаптопы. Для взаимодействия с государственным и частным сектором все чаще отдается предпочтение мобильным устройствам. В сзязи с этим государтсво переходит со своими услугами на мобильные платформы. Прототип приложения mRiik был готов уже в прошлом году, однако публичный запуск был отложен. Первоначальная версия была разработана в сотрудничестве с украинскими партнерами, которые запустили государственное приложение Diia в Украине уже в 2020 году. Эстонский прототип был протестирован 2000 пользователями. На основе обратной связи было принято решение продолжить техническую, дизайнерскую, а также законотворческую разработку. Спустя год государство в лице министерства экономики и коммуникаций, а также государственного агентства информационных систем (RIA) приняло решение представить приложение для общественного пользования в июне текущего года. Какова история создания приложения? Какие услуги и возможности будут представлены в первоначальной версии? Каким будет будущее государственного приложения? Почему был отложен первоначальный запуск и что поменялось с этих пор? Обо всем этом поговорим на нашей встрече."
          ]
        }
      },
      {
        "org": {"cam": ["eweber"], "edit": ["klinnik"]},
        "lang": "ru",
        "labels": [],
        "youtube": [],
        "speakers": [
          {
            "names": {"*": "Ilja Zverev", "ru": "Илья Зверев"},
            "titles": {"*": "Владелец свича / Switch owner"},
            "url": "https://www.linkedin.com/in/ilja-zverev/",
            "image": "izverev.jpg"
          }
        ],
        "titles": {"ru": "Как работают транспортные приложения."},
        "descr": {
          "ru": [
            "Sõiduplaanid, Google Maps, Citymapper, Moovit, Easy Transit... Приложений для планирования поездок на общественном транспорте тьма. Как так получилось, неужели их действительно просто писать? Короткий ответ — да, все данные открыты и схемы просты. А длинный ответ можно послушать вживую: что такое GTFS и Siri, на какие ухищрения идут авторы,  чтобы не качать десятки мегабайт, как выдержать баланс между клиентом и сервером, почему модель открытых исходников здесь не всегда помогает, и почему бы не сделать, наконец, единое приложение, чтобы всем было хорошо?"
          ]
        }
      }        
    ]
  }
]
