[
  {
    "num": 172,
    "datetime": "2023-11-28T19:00:00+03:00",
    "season": 2023,
    "place": {
      "name": "The von Stackelberg Hotel Tallinn", "loc": "https://goo.gl/maps/bKgbrTmjPkP2",
      "addr": "Toompuiestee 23, Tallinn 10137", "url": "https://www.vonstackelberghotel.com"
    },
    "org": {"mod": ["izverev"], "photo": ["gbeskin"]},
    "photo": [""],
    "event": "https://www.eventbrite.com/e/",
    "speeches": [
      {
        "org": {"cam": ["eweber"], "edit": ["klinnik"]},
        "lang": "ru",
        "labels": [],
        "youtube": [],
        "speakers": [
          {
            "names": {"*": "Ервин Вебер", "ru": "Erwin Weber"},
            "titles": {"*": "PACTUM"},
            "url": "https://www.linkedin.com/in/webervin",
            "image": "eweber_2023.jpg"
          }
        ],
        "titles": {"ru": "SLSA 1.0: Полный билдец!"},
        "descr": {
          "ru": [
            "SLSA (Software Supply Chain Security Levels) - это новый подход к обеспечению безопасности ПО, который фокусируется на защите программного обеспечения на всех этапах его жизненного цикла. В версии 1.0 SLSA фокусируется на трех уровнях безопасности: L1, L2 и L3. Каждый уровень имеет свои собственные требования к безопасности, которые повышаются по мере увеличения уровня. Давайте обсудим в клубной обстановке какого мы до этого дошли и зачем это все."
          ]
        }
      },
      {
        "org": {"cam": ["eweber"], "edit": ["klinnik"]},
        "lang": "ru",
        "labels": [],
        "youtube": [],
        "speakers": [
          {
            "names": {"*": "Sergey Zubovich", "ru": "Сергей Зубович"},
            "titles": {"*": "CTO @ Bamboo Group"},
            "url": "https://www.linkedin.com/in/sergey-zubovich/",
            "image": "szubovich.jpg"
          }
        ],
        "titles": {"ru": "KPI-метрики для команд разработки"},
        "descr": {
          "ru": [
            "Когда-то задумывались ли вы о настоящей ценности KPI в вашей команде разработки? За десятилетия KPI прошли через много трансформаций, иногда кажется, что они очень субъективны. В своем выступлении я расскажу о практическом опыте команд разработки в Bamboo Group, прояснив истинное значение KPI и их эволюцию внутри компании. Мое выступление выходит за пределы чистой теории; это честный отчет о собственных испытаниях, победах и уроках команды на пути к улучшенной производительности и мотивации. Вы узнаете причины неудач определенных гипотез, подходы, которые сработали для разработчиков и сотрудников не в разработке, а также то, как Bamboo Group автоматизировала отчетность по ежемесячным KPI для синхронизации данных с другими отделами."
          ]
        }
      }      
    ]
  }
]
