[
  {
    "num": 137,
    "datetime": "2020-01-29T19:00:00+02:00",
    "season": 2020,
    "place": {
      "name": "Park Inn by Radisson Meriton Conference & Spa Hotel Tallinn", "loc": "https://goo.gl/maps/AJbuvwDS7co",
      "addr": "Toompuiestee 27/Paldiski mnt 4, 10149 Tallinn", "url": "https://www.parkinn.com/hotel-meriton-tallinn"
    },
    "org": {"mod": ["jgoloborodko"], "photo": ["klinnik"]},
    "photo": [],
    "event": "",
    "speeches": [
      {
        "org": {"cam": [""], "edit": [""]},
        "lang": "ru",
        "labels": [],
        "youtube": [],
        "speakers": [
          {
            "names": {"*": "Aleksandra Madis", "ru": "Александра Мадис"},
            "titles": {"*": "Senior Software Engineer @ Microsoft"},
            "url": "https://www.linkedin.com/in/aleksandra-madis-93255820",
            "image": "amadis.jpg"
          }
        ],
        "titles": {"ru": "Хьюстон, у нас проблемы!"},
        "descr": {
          "ru": [
            "Рассказ о Grace Hopper Celebration of Women in Computing (GHC) – крупнейшей в мире конференции, объединяющей женщин, заинтересованных или работающих в сфере информационных технологий, а также центре NASA в Хьюстоне. На конференцию собирается более 20 000 женщин из IT области со всего мира. Что это за конференция, билеты на которую расходятся за считаные минуты? Что там происходило в 2018 году? О чём рассказывали? Также поговорим о VIP-туре (Level 9 Tour) по центру NASA."
          ]
        }
      },
      {
        "org": {"cam": [""], "edit": [""]},
        "lang": "ru",
        "labels": [],
        "youtube": [],
        "speakers": [
          {
            "names": {"*": "", "ru": "Антон Бабенко"},
            "titles": {"*": "Terraform fanatic, CEO @ Betajob"},
            "url": "https://www.linkedin.com/in/antonbabenko",
            "image": "ababenko.jpg"
          }
        ],
        "titles": {"*": "Terraform & Terragrunt"},
        "descr": {
          "ru": [
            "Антон расскажет о Terraform 0.12 с разных точек зрения. Начиная с процесса обновления, компромиссов и хаков. Для чего Terraform? Почему вы должны быть в восторге от его использования? Некоторые мнения не будут похожи на ответы типичного сотрудника / консультанта, которые вы, возможно, слышали раньше. Он также опишет Terragrunt, покажет преимущества и недостатки использования его с реальным кодом реальных клиентов. Доклад будет довольно интерактивным с реальным кодом, так что не стесняйтесь задавать ваши проблемы и вопросы."
          ]
        }
      },
      {
        "org": {"cam": [""], "edit": [""]},
        "lang": "ru",
        "labels": [],
        "youtube": [],
        "speakers": [
          {
            "names": {"*": "Sergei Chipiga", "ru": "Сергей Чипига"},
            "titles": {"*": "Software Engineer @ Pipedrive"},
            "url": "https://www.linkedin.com/in/sergei-chipiga-05b29661/",
            "image": "schipiga.jpg"
          }
        ],
        "titles": {"*": "Профилирование кода в Python"},
        "descr": {
          "ru": [
            "Когда разработчики начинают говорить о профилировании кода, в большинстве случаев это выглядит как нечто экстраординарное, требующее специальных навыков и глубокого знания языка программирования. Другими словами, правильное профилирование приложения похоже на джедайские навыки. Конечно, профилирование приложений требует опыта и времени на исследования, но в целом никакой магии в этом нет. На конкретном примере я хотел бы показать, как это происходит при профилировании продакшн-приложения.",
            "В мире Python существует несколько инструментов профилирования. Я буду использовать py-spy, потому что он может подключаться к рабочему процессу, имеет широкий список опций и может генерировать формат flame результатов. Сперва на простых примерах мы познакомимся с самим инструментом py-spy и flame форматом. А затем уже рассмотрим дамп с реального приложения под высокой нагрузкой, которое оказалось в зависшем состоянии, и увидим как интерпретировать результаты дампа, чтобы найти проблемные места в коде."
          ]
        }
      }
    ]
  }
]
