[
  {
    "num": 148,
    "datetime": "2021-10-28T19:00:00+03:00",
    "season": 2021,
    "place": {
      "name": "Põhja Öökull", "loc": "https://www.google.com/maps/@59.4455381,24.7192036,3a,37.3y,36.16h,87.97t/data=!3m7!1e1!3m5!1stKF8tAi0sdqNhMey-Yv6-g!2e0!6s%2F%2Fgeo3.ggpht.com%2Fcbk%3Fpanoid%3DtKF8tAi0sdqNhMey-Yv6-g%26output%3Dthumbnail%26cb_client%3Dmaps_sv.tactile.gps%26thumb%3D2%26w%3D203%26h%3D100%26yaw%3D328.5263%26pitch%3D0%26thumbfov%3D100!7i13312!8i6656",
      "addr": "Kopli 70a, 10411 Tallinn", "url": "https://www.facebook.com/P%C3%B5hja-%C3%96%C3%B6kull-109799177453157"
    },
    "org": {"mod": ["astalnuhhin"], "photo": ["gbeshkin"]},
    "photo": [],
    "event": "https://www.eventbrite.com/e/devclubeu-148-tickets-195924374077",
    "speeches": [
      {
        "org": {"cam": [""], "edit": [""]},
        "lang": "ru",
        "labels": [],
        "youtube": [],
        "speakers": [
          {
            "names": {"*": "Pavel Gerasimov", "ru": "Павел Герасимов"},
            "url": "https://www.linkedin.com/in/gerasimovpk",
            "titles": {"ru": "Инженерный менеджер @ Wrike"},
            "image": "pgerasimov.jpeg"
          }
        ],
        "titles": {"ru": "“Сделайте это быстрее!” Как улучшить производительность одной из самых сложных вьюх в продукте."},
        "descr": {
          "ru": [
            "Иногда (ну, всегда) продукты развиваются, сталкиваются с новыми требованиями, и ваши легаси вьюшки, разработанные в старые добрые времена, начинают работать не так хорошо, как ожидают клиенты. Для решения этой проблемы у вас есть два пути - переписать все с нуля (что обычно приводит в ярость стейкхолдеров) или попытаться улучшить существующую кодовую базу, чтобы она соответствовала новым требованиям.",
            "Мы расскажем, как мы начали страдать от проблем с производительностью в Wrike Workload - одной из самых тяжелых и сложных вьюх в нашем продукте, как мы улучшили общую производительность за несколько месяцев, и какие инструменты и технологии мы использовали для этого.",
            "О докладчике: \"Инженерный менеджер нескольких межфункциональных команд в Wrike. Бывший CEO и соучредитель Le Talo Robotics - стартапа, где наш автономный самозаряжающийся дрон, находящийся в Москве, управлялся из Китая.\""
          ]
        }
      },
      {
        "org": {"cam": [""], "edit": [""]},
        "lang": "ru",
        "labels": [],
        "youtube": [],
        "speakers": [
          {
            "names": {"*": "Aleksei Sharov", "ru": "Алексей Шаров"},
            "titles": {"ru": "Фронтенд-техлид @ Wrike"},
            "image": "asharov.jpg"
          }
        ],
        "titles": {"ru": "Нейросети для чайников, теория и практика"},
        "descr": {
          "ru": [
            "В этом докладе мы поговорим про то, что из себя представляют простейшие нейронные сети, как они работают и обучаются, а в конце - покажем пару работающих примеров.",
            "О докладчике: \"Фронтенд-техлид юнита Wrike for IT в компании Wrike. Работал в компаниях Borland и Dell, делаю фронт уже 15 лет - от Ruby on Rails и MVC.NET до Angular и React. Люблю Dart и Flutter, в свободное время... программирую. 🙂\""
          ]
        }
      },
      {
        "org": {"cam": [""], "edit": [""]},
        "lang": "ru",
        "labels": [],
        "youtube": [],
        "speakers": [
          {
            "names": {"*": "Jevgeni Kot", "ru": "Евгений Кот"},
            "titles": {"ru": "Директор по развитию @ Wrike"},
            "image": "jkot.jpg"
          }
        ],
        "titles": {"ru": "Камо грядеши, фронтенд?"},
        "descr": {
          "ru": [
            "Сейчас нет отрасли более стремительно развивающейся, чем фронтенд. Можно поспорить, но сколько ещё экосистем вы знаете, где фреймворки возникают с такой скоростью? Веб стандарты внедряются и тут же устаревают. Самый главный вопрос: куда мы идём, и к чему придём? Вопрос не праздный: как не остаться не у дел в этом бурлящем потоке и схватить только самое важное, то, что будет трендом в 2022 году.",
            "О докладчике: \"Фронтенд-разработчик в течение многих лет, спикер. Соорганизатор конференции HolyJS. Dart/Flutter/Web GDE. Директор по развитию @ Wrike. Евгений прошел долгий путь от C++ и низкоуровневого программирования до пользовательских интерфейсов и \"браузерных штучек\". В конце концов, что, если не Web, лучше всего отражает внутреннюю суть мироздания?\""
          ]
        }
      }
    ]
  }
]
